app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts"
---
  def index
    @contacts = Contact.all

INSERT INTO "contacts" ("firstname", "lastname", "phone", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["firstname", ""], ["lastname", ""], ["phone", ""], ["email", ""], ["created_at", 2017-02-28 00:26:51 UTC], ["updated_at", 2017-02-28 00:26:51 UTC]]
---
  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_contact
      @contact = Contact.find(params[:id])